{
  "title": "Empirically Measuring Data Localization in the EU",
  "keywords": ["Data Localization", "GDPR", "Internet Measurement"],
  "abstract": "EU data localization regulations limit data transfers to non-EU countries with the GDPR. However, BGP, DNS and other Internet protocols were not designed to enforce jurisdictional constraints, so implementing data localization is challenging. Despite initial research on the topic, little is known about if or how companies currently operate their server infrastructure to comply with the regulations. We close this knowledge gap by empirically measuring the extent to which servers and routers that process EU requests are located outside of the EU (and a handful of 'adequate' non-EU countries). The key challenge is that both browser measurements (to infer relevant endpoints) and data-plane measurements (to infer relevant IP addresses) are needed, but no large-scale public infrastructure allows both. We build a novel methodology that combines BrightData (browser) and RIPE Atlas (data-plane) probes, with joint measurements from over 1,000 networks in 20 EU countries. We find that, on average, 2.2% of servers serving users in each EU country are located in non-adequate destination countries (1.4% of known trackers). Our findings suggest that data localization policies are largely being followed by content providers, though there are exceptions.",
  "authors": [
    {
      "first_name": "Alexander",
      "last_name": "Gamero-Garrido",
      "institution": "University of California, Davis"
    },
    {
      "first_name": "Kicho",
      "last_name": "Yu",
      "institution": "University of Southern California"
    },
    {
      "first_name": "Sumukh",
      "last_name": "Vasisht Shankar",
      "institution": "Yale University"
    },
    {
      "first_name": "Sachin Kumar",
      "last_name": "Singh",
      "institution": "University of Utah"
    },
    {
      "first_name": "Sindhya",
      "last_name": "Balasubramanian",
      "institution": "Northeastern University"
    },
    {
      "first_name": "Alexander",
      "last_name": "Wilcox",
      "institution": "Northeastern University"
    },
    {
      "first_name": "David",
      "last_name": "Choffnes",
      "institution": "Northeastern University"
    }
  ],
  "attestation": "I attest that the values in this file are correct and exactly match those in the accompanying PDF file."
}
